src/test/jmeter/simple-assert.yml
---
execution:
- concurrency: 1
  iterations: 50
  scenario: sc

reporting:
- module: final-stats
    summary: true
    percentiles: true
    failed-labels: false
    test-duration: true
    dump-xml: stats.xml
- module: passfail
criteria:
- avg-rt of IndexPage>150ms for 10s, stop as failed
- fail of CheckoutPage>50% for 10s, stop as failed
scenarios:
  sc:
    requests:
    - http://bookstore.dev.matxa.es/
    - url: http://bookstore.dev.matxa.es/
      label: should-fail
      assert:
      - "non-exist"